## Plan Result (prod_backend_database)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.postgresql_password
  * azurerm_key_vault_secret.postgresql_username




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.postgresql_password will be created
  + resource "azurerm_key_vault_secret" "postgresql_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.KeyVault/vaults/crime-portal-kv-prod"
      + name                    = "crime-portal-postgresql-prod-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.postgresql_username will be created
  + resource "azurerm_key_vault_secret" "postgresql_username" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.KeyVault/vaults/crime-portal-kv-prod"
      + name                    = "crime-portal-postgresql-prod-username"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":62,"Program":"tfcmt","SHA1":"","Target":"prod_backend_database","Vars":{}} -->